chipKIT32/chipKIT-core/pic32/cores/pic32/harmony/framework/peripheral/usb/processor/usb_p32mx440f512h.h
PLIB_INLINE SFR_DATA _USB_EP11_STALL_ON_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP11_EPSTALL_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP11_HANDSHAKE_ON_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP11_EPHSHK_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP12_CONTROL_OFF_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP12_EPCONDIS_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP12_RCV_ON_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP12_EPRXEN_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP12_XMIT_ON_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP12_EPTXEN_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP12_STALL_ON_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP12_EPSTALL_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP12_HANDSHAKE_ON_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP12_EPHSHK_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP13_CONTROL_OFF_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP13_EPCONDIS_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP13_RCV_ON_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP13_EPRXEN_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP13_XMIT_ON_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP13_EPTXEN_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP13_STALL_ON_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP13_EPSTALL_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP13_HANDSHAKE_ON_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP13_EPHSHK_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP14_CONTROL_OFF_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP14_EPCONDIS_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP14_RCV_ON_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP14_EPRXEN_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP14_XMIT_ON_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP14_EPTXEN_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP14_STALL_ON_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP14_EPSTALL_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP14_HANDSHAKE_ON_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP14_EPHSHK_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP15_CONTROL_OFF_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP15_EPCONDIS_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP15_RCV_ON_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP15_EPRXEN_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP15_XMIT_ON_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP15_EPTXEN_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP15_STALL_ON_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP15_EPSTALL_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP15_HANDSHAKE_ON_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP15_EPHSHK_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

/* Section 2 - Feature variant inclusion */

#define PLIB_TEMPLATE PLIB_INLINE
#include "../templates/usb_OTG_InterruptStatus_Default.h"
#include "../templates/usb_OTG_Interrupt_Default.h"
#include "../templates/usb_OTG_IDPinState_Default.h"
#include "../templates/usb_OTG_LineState_Default.h"
#include "../templates/usb_OTG_SessionValid_Default.h"
#include "../templates/usb_OTG_BSessionEnd_Default.h"
#include "../templates/usb_OTG_ASessionValid_Default.h"
#include "../templates/usb_OTG_PullUpPullDown_Default.h"
#include "../templates/usb_OTG_VbusPowerOnOff_Default.h"
#include "../templates/usb_OTG_VbusCharge_Default.h"
#include "../templates/usb_OTG_VbusDischarge_Default.h"
#include "../templates/usb_ActivityPending_Default.h"
#include "../templates/usb_SleepEntryGuard_Default.h"
#include "../templates/usb_ModuleBusy_Unsupported.h"
#include "../templates/usb_Suspend_Default.h"
#include "../templates/usb_ModulePower_32Bit16Bit.h"
#include "../templates/usb_GEN_InterruptStatus_Default.h"
#include "../templates/usb_GEN_Interrupt_Default.h"
#include "../templates/usb_ALL_Interrupt_Default.h"
#include "../templates/usb_ERR_InterruptStatus_Default.h"
#include "../templates/usb_ERR_Interrupt_Default.h"
#include "../templates/usb_LastEndpoint_Default.h"
#include "../templates/usb_LastDirection_Default.h"
#include "../templates/usb_LastPingPong_Default.h"
#include "../templates/usb_LastTransactionDetails_Default.h"
#include "../templates/usb_LiveJState_Default.h"
#include "../templates/usb_LiveSingleEndedZero_Default.h"
#include "../templates/usb_PacketTransfer_Default.h"
#include "../templates/usb_HostBusyWithToken_Default.h"
#include "../templates/usb_HostGeneratesReset_Default.h"
#include "../templates/usb_OpModeSelect_Default.h"
#include "../templates/usb_ResumeSignaling_Default.h"
#include "../templates/usb_BufferFreeze_Default.h"
#include "../templates/usb_StartOfFrames_Default.h"
#include "../templates/usb_NextTokenSpeed_Default.h"
#include "../templates/usb_DeviceAddress_Default.h"
#include "../templates/usb_FrameNumber_Default.h"
#include "../templates/usb_TokenPID_Default.h"
#include "../templates/usb_TokenEP_Default.h"
#include "../templates/usb_SOFThreshold_Default.h"
#include "../templates/usb_BDTBaseAddress_Default.h"
#include "../templates/usb_EyePattern_Default.h"
#include "../templates/usb_StopInIdle_Default.h"
#include "../templates/usb_AutomaticSuspend_Unsupported.h"
#include "../templates/usb_PingPongMode_Unsupported.h"
#include "../templates/usb_UOEMonitor_Unsupported.h"
#include "../templates/usb_OnChipPullup_Unsupported.h"
#include "../templates/usb_OnChipTransceiver_Unsupported.h"
#include "../templates/usb_SpeedControl_Unsupported.h"
#include "../templates/usb_EP0LowSpeedConnect_Default.h"
#include "../templates/usb_EP0NAKRetry_Default.h"
#include "../templates/usb_EPnTxRx_Default.h"
#include "../templates/usb_EPnRxEnableEnhanced_PIC32.h"
#include "../templates/usb_BDTFunctions_PIC32.h"

